# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть. 
# Стороны монеты вводятся построчно или в одну строку, если умеете.

n = int(input())
coins = input().split()
heads = coins.count('1') 
tails = coins.count('0')

if heads <= tails:
    flips = heads
else:
    flips = tails

print(flips) 
